NORMAL_LIST = [
    '凌阳',
    '安可',
    '卡卡罗',
    '鉴心',
    '维里奈',
    '漂泊者·衍射',
    '漂泊者·湮灭',

    '千古洑流',
    '停驻之烟',
    '擎渊怒涛',
    '漪澜浮录',
    '浩境粼光',
]

card_sort_map = {
    '生命': '0',
    '攻击': '0',
    '防御': '0',
    '共鸣效率': '0%',
    '暴击': '0.0%',
    '暴击伤害': '0.0%',
    '属性伤害加成': '0.0%',
    '治疗效果加成': '0.0%',
    '普攻伤害加成': '0.0%',
    '重击伤害加成': '0.0%',
    '共鸣技能伤害加成': '0.0%',
    '共鸣解放伤害加成': '0.0%'
}

SPECIAL_CHAR = {
    "1501": ["1501", "1502"],  # 光主
    "1502": ["1501", "1502"],
    "1604": ["1604", "1605"],  # 暗主
    "1605": ["1604", "1605"],
}

SPECIAL_CHAR_INT = {
    1501: [1501, 1502],  # 光主
    1502: [1501, 1502],
    1604: [1604, 1605],  # 暗主
    1605: [1604, 1605],
}
SPECIAL_CHAR_NAME = {
    "1501": "光主",
    "1502": "光主",
    "1604": "暗主",
    "1605": "暗主",
}
SPECIAL_CHAR_ID = {
    "漂泊者·衍射·男": "1501",
    "漂泊者·衍射·女": "1502",
    "漂泊者·湮灭·男": "1605",
    "漂泊者·湮灭·女": "1604",
}

NAME_ALIAS = {
    '漂泊者·湮灭': '暗主',
    '漂泊者·衍射': '光主'
}
