NORMAL_LIST = [
    '凌阳',
    '安可',
    '卡卡罗',
    '鉴心',
    '维里奈',
    '漂泊者',
    '漂泊者·湮灭',

    '千古洑流',
    '停驻之烟',
    '擎渊怒涛',
    '漪澜浮录',
    '浩境粼光',
]

SPECIAL_CHAR = {
    "1501": ["1501", "1502"],  # 光主
    "1502": ["1501", "1502"],
    "1604": ["1604", "1605"],  # 暗主
    "1605": ["1604", "1605"],
}
SPECIAL_CHAR_NAME = {
    "1501": "光主",
    "1502": "光主",
    "1604": "暗主",
    "1605": "暗主",
}
SPECIAL_CHAR_ID = {
    "漂泊者·男": "1501",
    "漂泊者·女": "1502",
    "漂泊者·湮灭·男": "1605",
    "漂泊者·湮灭·女": "1604",
}
