# id2name
DETAIL = {
    "1304": {
        "name": "今汐",
        "fetterDetail": "浮星祛暗"
    },
    "1604": {
        "sex": "女",
        "name": "漂泊者·湮灭",
        "fetterDetail": "沉日劫明"
    },
    "1303": {
        "name": "渊武",
        "fetterDetail": "高天共奏之曲"
    },
    "1105": {
        "name": "折枝",
        "fetterDetail": "高天共奏之曲"
    },
    "1505": {
        "name": "守岸人",
        "fetterDetail": "隐世回光"
    },
    "1605": {
        "sex": "男",
        "name": "漂泊者·湮灭",
        "fetterDetail": "沉日劫明"
    },
    "1205": {
        "name": "长离",
        "fetterDetail": "熔山裂谷"
    },
    "1506": {
        "name": "菲比",
        "fetterDetail": "此间永驻之光"
    },
    "1104": {
        "name": "凌阳",
        "fetterDetail": "凝夜白霜"
    },
    "1203": {
        "name": "安可",
        "fetterDetail": "熔山裂谷"
    },
    "1302": {
        "name": "吟霖",
        "fetterDetail": "高天共奏之曲"
    },
    "1502": {
        "sex": "女",
        "name": "漂泊者·衍射",
        "fetterDetail": "此间永驻之光"
    },
    "1405": {
        "name": "鉴心",
        "fetterDetail": "啸谷长风"
    },
    "1103": {
        "name": "白芷",
        "fetterDetail": "隐世回光"
    },
    "1106": {
        "name": "釉瑚",
        "fetterDetail": "隐世回光"
    },
    "1202": {
        "name": "炽霞",
        "fetterDetail": "熔山裂谷"
    },
    "1503": {
        "name": "维里奈",
        "fetterDetail": "隐世回光"
    },
    "1606": {
        "name": "洛可可",
        "fetterDetail": "幽夜隐匿之帷"
    },
    "1102": {
        "name": "散华",
        "fetterDetail": "轻云出月"
    },
    "1301": {
        "name": "卡卡罗",
        "fetterDetail": "彻空冥雷"
    },
    "1403": {
        "name": "秋水",
        "fetterDetail": "啸谷长风"
    },
    "1601": {
        "name": "桃祈",
        "fetterDetail": "轻云出月"
    },
    "1602": {
        "name": "丹瑾",
        "fetterDetail": "沉日劫明"
    },
    "1305": {
        "name": "相里要",
        "fetterDetail": "彻空冥雷"
    },
    "1204": {
        "name": "莫特斐",
        "fetterDetail": "高天共奏之曲"
    },
    "1107": {
        "name": "珂莱塔",
        "fetterDetail": "凌冽决断之心"
    },
    "1504": {
        "name": "灯灯",
        "fetterDetail": "彻空冥雷"
    },
    "1603": {
        "name": "椿",
        "fetterDetail": "沉日劫明"
    },
    "1501": {
        "sex": "男",
        "name": "漂泊者·衍射",
        "fetterDetail": "此间永驻之光"
    },
    "1404": {
        "name": "忌炎",
        "fetterDetail": "啸谷长风"
    },
    "1402": {
        "name": "秧秧",
        "fetterDetail": "啸谷长风"
    },
    "1206": {
        "name": "布兰特",
        "fetterDetail": "无惧浪涛之勇"
    },
    "1408": {
        "sex": "女",
        "name": "漂泊者·气动",
        "fetterDetail": "流云逝尽之空"
    },
    "1406": {
        "sex": "男",
        "name": "漂泊者·气动",
        "fetterDetail": "流云逝尽之空"
    },
    "1607": {
        "name": "坎特蕾拉",
        "fetterDetail": "幽夜隐匿之帷"
    },
}


# 4cost
SONATA_COST_4_ID = {
    "凝夜白霜": [6000044, 6000085],
    "熔山裂谷": [6000091, 390080007, 6000085],
    "彻空冥雷": [390080003, 6000039, 6000088, 6000089, 6000085],
    "啸谷长风": [6000086, 6000043, 6000085],
    "浮星祛暗": [6000059, 6000045, 6000085],
    "沉日劫明": [6000090, 6000053, 6000042, 6000085],
    "隐世回光": [6000060, 390080005],
    "轻云出月": [6000052, 390080005],
    "不绝余音": [6000048],
    "凌冽决断之心": [6000083],
    "高天共奏之曲": [6000085, 6000089, 6000105],
    "幽夜隐匿之帷": [6000082, 6000087],
    "此间永驻之光": [6000092],
    "无惧浪涛之勇": [6000084, 6000105],
    "流云逝尽之空": [6000106],
}

# 3cost
SONATA_COST_3_ID = {
    "凝夜白霜": [],
    "熔山裂谷": [],
    "彻空冥雷": [],
    "啸谷长风": [],
    "浮星祛暗": [],
    "沉日劫明": [],
    "隐世回光": [],
    "轻云出月": [],
    "不绝余音": [],
    "凌冽决断之心": [6000076],
    "高天共奏之曲": [6000076],
    "幽夜隐匿之帷": [],
    "此间永驻之光": [6000104],
    "无惧浪涛之勇": [],
    "流云逝尽之空": [6000104],
}

# 1cost
SONATA_COST_1_ID = {
    "凝夜白霜": [],
    "熔山裂谷": [],
    "彻空冥雷": [],
    "啸谷长风": [],
    "浮星祛暗": [],
    "沉日劫明": [],
    "隐世回光": [],
    "轻云出月": [],
    "不绝余音": [],
    "凌冽决断之心": [],
    "高天共奏之曲": [],
    "幽夜隐匿之帷": [],
    "此间永驻之光": [],
    "无惧浪涛之勇": [],
    "流云逝尽之空": [],
}