# id2name
DETAIL = {
    "今汐": {
        "id": "1304",
        "fetterDetail": "浮星祛暗"
    },
    "漂泊者·湮灭": {
        "id": "1604",
        "fetterDetail": "沉日劫明"
    },
    "渊武": {
        "id": "1303",
        "fetterDetail": "高天共奏之曲"
    },
    "折枝": {
        "id": "1105",
        "fetterDetail": "高天共奏之曲"
    },
    "守岸人": {
        "id": "1505",
        "fetterDetail": "隐世回光"
    },
    "漂泊者·湮灭": {
        "id": "1605",
        "fetterDetail": "沉日劫明"
    },
    "长离": {
        "id": "1205",
        "fetterDetail": "熔山裂谷"
    },
    "菲比": {
        "id": "1506",
        "fetterDetail": "此间永驻之光"
    },
    "凌阳": {
        "id": "1104",
        "fetterDetail": "凝夜白霜"
    },
    "安可": {
        "id": "1203",
        "fetterDetail": "熔山裂谷"
    },
    "吟霖": {
        "id": "1302",
        "fetterDetail": "高天共奏之曲"
    },
    "漂泊者·衍射": {
        "id": "1502",
        "fetterDetail": "此间永驻之光"
    },
    "鉴心": {
        "id": "1405",
        "fetterDetail": "啸谷长风"
    },
    "白芷": {
        "id": "1103",
        "fetterDetail": "隐世回光"
    },
    "釉瑚": {
        "id": "1106",
        "fetterDetail": "隐世回光"
    },
    "炽霞": {
        "id": "1202",
        "fetterDetail": "熔山裂谷"
    },
    "维里奈": {
        "id": "1503",
        "fetterDetail": "隐世回光"
    },
    "洛可可": {
        "id": "1606",
        "fetterDetail": "幽夜隐匿之帷"
    },
    "散华": {
        "id": "1102",
        "fetterDetail": "轻云出月"
    },
    "卡卡罗": {
        "id": "1301",
        "fetterDetail": "彻空冥雷"
    },
    "秋水": {
        "id": "1403",
        "fetterDetail": "啸谷长风"
    },
    "桃祈": {
        "id": "1601",
        "fetterDetail": "轻云出月"
    },
    "丹瑾": {
        "id": "1602",
        "fetterDetail": "沉日劫明"
    },
    "相里要": {
        "id": "1305",
        "fetterDetail": "彻空冥雷"
    },
    "莫特斐": {
        "id": "1204",
        "fetterDetail": "高天共奏之曲"
    },
    "珂莱塔": {
        "id": "1107",
        "fetterDetail": "凌冽决断之心"
    },
    "灯灯": {
        "id": "1504",
        "fetterDetail": "彻空冥雷"
    },
    "椿": {
        "id": "1603",
        "fetterDetail": "沉日劫明"
    },
    "漂泊者·衍射": {
        "id": "1501",
        "fetterDetail": "此间永驻之光"
    },
    "忌炎": {
        "id": "1404",
        "fetterDetail": "啸谷长风"
    },
    "秧秧": {
        "id": "1402",
        "fetterDetail": "啸谷长风"
    },
    "布兰特": {
        "id": "1206",
        "fetterDetail": "无惧浪涛之勇"
    },
    "漂泊者·气动": {
        "id": "1408",
        "fetterDetail": "流云逝尽之空"
    },
    "漂泊者·气动": {
        "id": "1406",
        "fetterDetail": "流云逝尽之空"
    },
    "坎特蕾拉": {
        "id": "1607",
        "fetterDetail": "幽夜隐匿之帷"
    },
}


# 4cost 6000105
SONATA_COST_4_ID = {
    "凝夜白霜": [6000044, 6000085],
    "熔山裂谷": [6000091, 390080007, 6000085],
    "彻空冥雷": [390080003, 6000039, 6000088, 6000089, 6000085],
    "啸谷长风": [6000086, 6000043, 6000085],
    "浮星祛暗": [6000059, 6000045, 6000085],
    "沉日劫明": [6000090, 6000053, 6000042, 6000085],
    "隐世回光": [6000060, 390080005],
    "轻云出月": [6000052, 390080005],
    "不绝余音": [6000048],
    "凌冽决断之心": [6000083],
    "高天共奏之曲": [6000085, 6000089],
    "幽夜隐匿之帷": [6000082, 6000087],
    "此间永驻之光": [6000092],
    "无惧浪涛之勇": [6000084],
    "流云逝尽之空": [6000106],
}

# 3cost
SONATA_COST_3_ID = {

}

# 1cost
SONATA_COST_1_ID = {

}